function ResultText({ percentage }) {
  return (
    <div className="resultText">
      <h3>
        {percentage >= 75
          ? "فرار کن، قبل از اینکه پرچم قرمز خفه‌ات کنه "
          : percentage >= 60
            ? "داداش... این دیگه فقط یه سوءتفاهم نیست "
            : percentage >= 41
              ? "یه کم آروم‌تر! پرچم‌ها دارن تکون می‌خورن "
              : percentage >= 21
                ? "یه چیزایی اینجا عجیبه"
                : "فعلاً چراغ سبزه، برو جلو 🚦"}
      </h3>
      <p>
        {percentage >= 75
          ? "این حجم از رد فلگ دیگه تحلیل نمی‌خواد، مستند می‌خواد. فرار کن سریع"
          : percentage >= 60
            ? "اینجا پرچم قرمز نیست، کارخانه‌ی پرچم قرمزه. دور شو ازش سریع"
            : percentage >= 41
              ? "تبریک می‌گم، رابطه‌تون رسماً وارد منطقه قرمز شد🚨. سعی کنید باهم صحبت کنید براش حلش اگه میتونید. "
              : percentage >= 21
                ? "نگران نباش، فعلاً فقط یه پرچم کوچولو گوشه‌ی تصویر دیده شد. ولی سعی کن باهاش صحبت کنی که حل شه."
                : "سبزه سبزه فعلا و نگران نباش با خیالت راحت رو به جلو حرکت کن🟢."}
      </p>
    </div>
  );
}

export default ResultText;
